import React from 'react';
import './pages.css';

const Appeal = () => {
    return (
        <div className='body'>
            <h2>【向上心と自主的な学習】</h2>
            <p>大学のIT講義をきっかけにシステムエンジニアとしてのキャリアをスタートしました。現在はフロントエンド、バックエンド両方の開発を独学で学習しています。大学時代にHTML/CSSを使ったウェブサイト作成の経験がありますが、Reactを使用しフロントエンドの開発を円滑に、更には未経験ながらバックエンド開発にも挑戦しています。新しい技術を柔軟に吸収し、エラーを自力で解決する力を磨いています。将来的にはシステム全体を設計できるエンジニアを目指しています。
            </p>
            <h2>【トラブルシューティングと問題解決力】</h2>
            <p>前職ではトラブルチケット対応を担当し、ログやエラーを分析して原因を特定していました。ベンダーに指摘した内容が的中し、早期解決に繋がることが多くありました。この経験から「自分で修正までできれば、さらに迅速に対応できる」と考え、開発スキルの習得を決意しました。現在はその経験を活かし、自身のプロジェクトでエラーの原因を突き止めて修正する力を伸ばしています。
            </p>
            <h2>【ユーザー目線の開発と業務効率化】</h2>
            <p>「不便を技術で解決する」ことを大切にし、前職ではExcel VBAを活用して業務を効率化しました。ただ自動化するだけでなく、より楽に・正確に作業できる仕組みを考え、実際に先輩社員から「便利になった」と喜ばれました。この経験を活かし、今後は開発でもユーザー目線を大切にしたシステム設計をしていきたいと考えています。
            </p>
        </div>
    );
};

export default Appeal;