import React from 'react';
import './pages.css';

const Introduction = () => {
    return (
        <div className='body'>
            <h1>沼田 優里</h1>
            <p>ここに写真を入れる</p>
            <h2>♡Favorite things♡</h2>
                <h3>ダンス</h3>
                    <ul>
                        <li>小学校1年生～小学校3年生    モダンダンス</li>
                        <li>小学校4年生～高校3年生      ストリートダンス (Jazz Hiphop)</li>
                        <li>高校2年生～高校3年生        キッズクラスインストラクター</li>
                        <li>大学生                     フラダンス</li>
                    </ul>
                    <p>
                        小学生の頃から踊ることが大好きです！高校時代には、未就学児を対象にキッズクラスのインストラクターをしました。
                        海外留学を機にストリートダンスはやめましたが、ハワイの大学だったためフラダンスに挑戦しました。
                        ハワイのお友達に教えてもらいながら楽しくフラダンスを学び、時には腰振りで有名なタヒチアンダンスも教えてもらいました！
                        最近は運動不足解消のためにレッスンを受けに行ったり、踊ってみたの動画をみるのが好きです！
                        自分が踊ることも、ダンスお教えて楽しさを知ってもらうのも、人が楽しく踊っているのを見るのも、全てが大好きです！
                    </p>
                <h3>ゲーム</h3>
                    <p>
                        大学時代にコロナウイルス蔓延で日本とハワイの行き来の度に、2週間の隔離生活がありました。
                        2週間外に出られないので、退屈しのぎで購入したPlayStation4で自分がゲーム好きだと気がつきました。
                        社会人1年目、ついに購入したゲーミングPCで楽しくゲームをする日々を送っています。
                        FPS、RPG、推理、シミュレーション、パズル、リズム、様々な種類のオンラインゲームを楽しんでいます。
                        また、友達をわいわいボードゲームで遊ぶのも好きです。
                        最近ではボードゲームカフェというものもあり、ボードゲームを持っていなくても楽しめる施設があるので、友達とそういうところで遊ぶのも好きです。
                    </p>
                <h3>ハワイ</h3>
                    <p>
                        私が3歳くらいの頃、叔母の結婚式でハワイを訪れたのがきっかけで母がハワイにハマり、数年に1度はハワイを訪れるようになりました。
                        冬に行っても暖かい気候、綺麗な海、陽気な人々、日本にはない景色や体験がいっぱいで大好きになりました！
                        大学を決めた理由の一つでもあります。
                        大学時代は大好きなハワイで生活できたので、大好きな景色を見ながら生活できたのがすごく幸せな思い出です。
                        大学時代のアルバイトでは、大学に隣接しているポリネシア文化センターでツアーガイドをしました。
                        ハワイの文化や他のポリネシアの文化を紹介する施設なのですが、植物や建物が昔ながらの建物を再現していたので、毎日のバイトがすごく楽しかったです！
                    </p>
            <h2>week point</h2>
                <h3>ホラー</h3>
                    <p>
                        ホラー映画、ホラーゲーム、お化け屋敷、怖いもの全般苦手です
                    </p>
                <h3>虫</h3>
                    <p>
                        ハワイにいた頃は退治してくれる人もいなかったので、生存本能なのか少し虫には慣れていきましたが、やはり苦手なものは苦手です。
                    </p>
                <h3>人混み</h3>
                    <p>
                        人が多くてにぎやかなところは好きですが、人が多すぎて歩くのが大変なところには苦手意識があります。
                    </p>
        </div>
    );
};

export default Introduction;